<a href="https://colab.research.google.com/github/ASLManasa/MY_Ml/blob/main/RandomForests.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
data = pd.read_csv('/content/Position_Salaries.csv')
data

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [3]:
data.isnull()

   Position  Level  Salary
0     False  False   False
1     False  False   False
2     False  False   False
3     False  False   False
4     False  False   False
5     False  False   False
6     False  False   False
7     False  False   False
8     False  False   False
9     False  False   False

In [4]:
x = data.iloc[:,1:-1]
#print(x)
y = data.iloc[:,-1]
#print(y)

In [5]:
from sklearn.model_selection import train_test_split  
x_train, x_test, y_train, y_test= train_test_split(x, y, test_size= 0.25, random_state=0)

In [ ]:
from sklearn.ensemble import RandomForestRegressor
classifier= RandomForestRegressor(n_estimators= 10)  
classifier.fit(x_train, y_train)

In [8]:
y_pred = classifier.predict(x_test)

In [9]:
y_pred = classifier.predict([[5.6]])
y_pred

array([170000.])